["Brand Data Challenge: Brandy! Your chatbot for a brand compliance review Brand Guidelines for PPTs – WORK IN PROGRESS Background and Font Color for Text Always consider the color contrast between the background and text. Emphasis For highlighting, use bold or underlined – not italics. Italics are very difficult to read for some people. Fonts SAP’s preferred font is 72 Brand. When we can’t use 72 Brand we use Arial, a system font, as a substitute (for example e-mail, HTML texts, and so on…). If needed, Trebuchet MS can also be used for better readability. Start with at least 11pt font size. Note that colleagues have the option to increase the size of text when reading documents. Core 72 Brand Weight Range A simplified set of weights of 72 Brand should cover many use cases for most users: 72 Brand Medium - for larger text like headlines and subheads. 72 Brand Regular - for smaller text like body copy. 72 Brand Bold - can be used for emphasis. Matching italic styles are also available for all weights shown. Style These types of style guidelines aid in standability and comprehension. Whenever possible, use left-aligned text. It is easier to read than centered or fully justified text. Line length and column width should adjust based on type size, but a range of 30—80 characters is preferred. Use sentence case to convey a friendly tone. Avoid using all lowercase or all uppercase. Only use Title Case for proper nouns approved by SAP. By default, type should be no smaller than 11 points. Color Contrast While high-contrast combinations like black and white offer clarity, color can help add depth and expression to messaging. To ensure text has sufficient contrast in brightness from its background, use the following guidance when pairing colors. Large text above 24pt should have at least a 3:1 contrast ratio. Smaller text below 24pt should have at least a 4.5:1 contrast ratio. Hyperlinks: Instead of just writing the word “link” or “here” when hyperlinking to other pages, use meaningful text for hyperlinks (for example Inclusion and Equality SharePoint). Otherwise, colleagues using a screen reader will not know what the hyperlink is pointing to. Anvils The anvil is flexible and has multiple use cases. It can be used layered into photographs, as a window into photographs, as a step gradient, and to create graphic patterns. When using the Anvil as a flat graphic, it can be paired with shades from the same color range (in this case blue) to create a subtle tone-on-tone effect. Using typography in combination with the flat Anvil graphic creates continuity between brand language and brand visuals. The Anvil can also be paired with silhouetted photography in order to call out specific industries, subjects, or products, or to infuse the narrative that SAP is always there to bring out the better business inside every business. Anvil with Text Short Headline, Stacked Left-aligned text, vertically centered with Anvil Headline breaks edges of Anvil on top and bottom sides, and", "should not extend beyond the far right corner Cap height should be 40%–50% the height of the Anvil Headlines should be three lines maximum Short Headline, Single Line Vertically and horizontally centered with Anvil Headline breaks edges of Anvil on the left and right sides Cap height should be 20%–25% the height of the Anvil Headlines should be on one line Long Headline, Contained Left-aligned text, vertically centered with the Anvil Left margin is 1/8 height of the Anvil Cap height of text should be about 13%–20% Anvil height Headlines should be limited to three lines of text Long Headline, Overlapping Left aligned text, vertically centered with Anvil Left margin is 1/8 height of the Anvil Headline breaks edge on angled side Cap height of text should be about 13%–20% Anvil height Headlines should be limited to three lines of text Boldface • Use boldface sparingly to emphasize individual words or parts of sentences. Do not use another form of emphasis for this purpose, such as quotation marks, italics, or underlining. Italics is difficult to read from an accessibility point of view, and underlining can be interpreted as a hyperlink. X Sign up for SAP Customer Success Summit. Deadline: November 2022 √ Sign up for SAP Customer Success Summit. Deadline: November 2022 • Do not use boldface for entire sentences or paragraph"]